Repository: albanobattistella/kopypast
Catalog: translate/*.po
Languages: it

source: General
it: Generale

source: Backup Snippets
it: Backup di Snippets

source: Restore Snippets
it: Ripristina Snippets

source: Backup contains no snippets
it: Il backup non contiene snippet

source: Invalid snippet format
it: Formato dello snippet non valido

source: All snippets are duplicates
it: Tutti gli snippet sono duplicati

source: Cannot restore snippets: maximum limit (%1) reached
it: Impossibile ripristinare gli snippet: raggiunto il limite massimo (%1)

source: Only restored %1 snippet due to maximum limit
it: Ripristinato solo lo snippet %1 a causa del limite massimo

source: Restored %1 snippet, skipped %2 duplicate(s)
it: Ripristinato %1 snippet, saltati %2 duplicato(i)

source: Successfully restored %1 snippet
it: Snippet %1 ripristinato correttamente

source: Invalid backup format
it: Formato di backup non valido

source: Copy and save the contents below to back up your snippets:
it: Copia e salva i contenuti seguenti per eseguire il backup dei tuoi snippet:

source: Paste the backup contents below to restore your snippets:
it: Incolla i contenuti del backup di seguito per ripristinare i tuoi snippet:

source: Backup Contents
it: Contenuto di backup

source: Copy
it: Copia

source: Appearance
it: Aspetto

source: Configure how the widget looks
it: Configura l'aspetto del widget

source: Monochrome icon
it: Icona monocromatica

source: Use a monochrome icon that matches the color scheme
it: Utilizzare un'icona monocromatica che corrisponda allo schema dei colori

source: Enable search bar
it: Abilita barra di ricerca

source: Show a search field at the top of the widget
it: Mostra un campo di ricerca nella parte superiore del widget

source: Show bottom toolbar
it: Mostra barra degli strumenti in basso

source: Place a toolbar with counter and buttons at the bottom
it: Posiziona una barra degli strumenti con contatore e pulsanti in basso

source: Hide snippet previews
it: Nascondi anteprime snippet

source: Show only snippet titles without content previews
it: Mostra solo i titoli degli snippet senza anteprime dei contenuti

source: Functionality
it: Funzionalit√†

source: Configure behavior and limitations
it: Configurare comportamento e limitazioni

source: Maximum number of snippets:
it: Numero massimo di snippet:

source: Limit the number of snippets for optimal performance
it: Limita il numero di snippet per prestazioni ottimali

source: Keyboard navigation
it: Navigazione tramite tastiera

source: Use the keyboard keys to navigate and select snippets
it: Utilizza i tasti della tastiera per navigare e selezionare gli snippet

source: Clear search on copy
it: Cancella ricerca su copia

source: Clear the search field after a snippet is copied
it: Cancella il campo di ricerca dopo aver copiato uno snippet

source: Variable processing
it: Elaborazione variabile

source: Handle available variables in the snippet text
it: Gestire le variabili disponibili nel testo dello snippet

source: No snippets added
it: Nessun snippets aggiunto

source: Add your first snippet using the button below
it: Aggiungi il tuo primo snippet utilizzando il pulsante qui sotto

source: Edit
it: Modifica

source: Delete
it: Elimina

source: Add Snippet
it: Aggiungi Snippet

source: Maximum limit reached
it: Limite massimo raggiunto

source: Restore
it: Ripristina

source: Search for snippets...
it: Cerca snippet...

source: No snippets available
it: Nessun snippet disponibile

source: Add snippets in the settings
it: Aggiungi snippet nelle impostazioni

source: No matching snippets
it: "Nessun snippet corrispondente

source: Try a different search term
it: Prova un termine di ricerca diverso

source: Copied!
it: Copiato!

source: Configure
it: Configura

source: Keep Open
it: Tieni aperto

source: Edit Snippet
it: Modifica Snippet

source: Snippet Title
it: TItolo del Snippet

source: Snippet Text
it: Testo Snippet

source: Available Variables
it: Variabili disponibili

source: current date in local format
it: data corrente in formato locale

source: current time in local format
it: ora corrente in formato locale

source: current date and time
it: data e ora correnti

source: date in YYYY-MM-DD format
it: data nel formato AAAA-MM-GG

source: time in HH:mm:ss format
it: ora nel formato HH:mm:ss

source: full ISO date and time
it: data e ora ISO complete

source: current year (4 digits)
it: anno corrente (4 cifre)

source: current month (01-12)
it: mese corrente (01-12)

source: current day (01-31)
it: giorno corrente (01-31)

source: current hour (00-23)
it: ora corrente (00-23)

source: current minute (00-59)
it: minuto corrente (00-59)

source: current second (00-59)
it: secondo corrente (00-59)
